jaowens14/DeltaTPlus_STM32WB55RG_0925/DeltaTPlus_STM32WB55RG_090525/Core/Src/main.cpp
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "dma.h"
#include "i2c.h"
#include "ipcc.h"
#include "memorymap.h"
#include "rf.h"
#include "rtc.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "usb_device.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
// #include "Adafruit_GFX.h"
//  #include "usbd_cdc_if.h"
#include "stm32_seq.h"

// #include "ST7789V_STM32.h"
// #include "Screen.hpp"
#include "Accelerometer.hpp"
#include "Backlight.hpp"
#include "Thermocouples.hpp"
#include "DeltaT.h"
#include "screen.h"
#include "BatteryMonitor.h"
#include "Touch.hpp"
#include "FT5436_Touch.h"
#define LV_LVGL_H_INCLUDE_SIMPLE

#define WEB_LIGHT_TAN 0xf0ead0
#define WEB_BLACK 0x382922
#define WEB_ORANGE 0xdf571d

#include "lvgl.h"
#include "ST7789.h"
// #include "lv_port_disp.h"
// #include "examples/anim/lv_example_anim.h"
// #include "examples/widgets/arclabel/lv_example_arclabel.h"
#include "examples/anim/lv_example_anim.h"
// #include "AD7124/ad7124_console_app.h"
// #include "ad7124_console_app.h"
// #include "ad7124.h"
// #include "ad7124_regs.h"
/* USER CODE END Includes */

// Global pointer to update the meter value
static lv_obj_t *meter_needle = NULL;
static lv_obj_t *meter_value_label = NULL;
static lv_obj_t *meter_arc = NULL;

static lv_obj_t *leftHeaderLabel = NULL;
static lv_obj_t *rightHeaderLabel = NULL;
static lv_obj_t *needle = NULL;

// Configuration
#define METER_MIN_VALUE -25
#define METER_MAX_VALUE 25
#define METER_RANGE (METER_MAX_VALUE - METER_MIN_VALUE)
#define METER_START_ANGLE 225 // Start angle (225° = bottom-left)
#define METER_END_ANGLE 315   // End angle (315° = bottom-right, 90° span)

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
uint8_t UART_BUFFER[128] = {0};
#define BYTE_PER_PIXEL 2
lv_display_t *display1 = NULL; // Global variable

static uint8_t buffer1[ST7789_WIDTH * ST7789_HEIGHT / 10 * BYTE_PER_PIXEL];
// static uint8_t buffer2[ST7789_WIDTH * ST7789_HEIGHT / 32 * BYTE_PER_PIXEL];

/* USER CODE END PTD */
/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
// static struct ad7124_dev *pAd7124_dev = NULL;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
volatile int timerCounter = 0;
volatile uint32_t loopCounter = 0;
volatile uint32_t loopsPerSecond = 0;
volatile uint8_t measureFlag = 0;
Accelerometer myAccelerometer;
Backlight myBacklight;
Thermocouples myThermocouples;
// Screen myScreen;
Touch myTouch;

///////////////////////////////////////////////////

/* Timer callback to update the text area with sensor data */
static void updateLeftHeaderLabel(lv_timer_t *timer)
{
  char *switchState;

  if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_0))
  {
    switchState = "HIGH";
    Thermocouples::userGain = 2.0;
  }
  else
  {
    switchState = "LOW";
    Thermocouples::userGain = 1.0;
  }

  lv_obj_t *ta = (lv_obj_t *)lv_timer_get_user_data(timer);

  char buf[32];
  snprintf(buf, sizeof(buf), "%s", switchState);

  lv_label_set_text(ta, buf);
}

static void updateRightHeaderLabel(lv_timer_t *timer)
{
  int batteryLevel = getChargeLevel();

  lv_obj_t *ta = (lv_obj_t *)lv_timer_get_user_data(timer);

  char buf[32];
  snprintf(buf, sizeof(buf), "%d%%", batteryLevel);

  lv_label_set_text(ta, buf);
}

static void updateNeedle(lv_timer_t *timer)
{

  int data = get_sensor_data();
  int16_t angle = data * scale_factor; // map your data to angle

  lv_obj_set_style_transform_angle(needle, angle, 0);
}

void brookes_meter(void)
{
  {
    /* Create a scale object */
    lv_obj_t *scale = lv_scale_create(lv_screen_active());
    lv_obj_set_size(scale, 250, 250);
    // lv_obj_center(scale);
    lv_obj_align(scale, LV_ALIGN_CENTER, 0, 30); // Shift down 30 pixels from center

    /* Configure the scale to go from -45 to 45 degrees */
    lv_scale_set_mode(scale, LV_SCALE_MODE_ROUND_OUTER);

    /* Set the range from -25 to 25 */
    lv_scale_set_range(scale, -25, 25);

    /* Configure angle range: start at 210° , total arc of 120*/
    lv_scale_set_rotation(scale, 210);
    lv_scale_set_angle_range(scale, 120);

    /* Set total number of ticks */
    lv_scale_set_total_tick_count(scale, 51); /* Major + minor ticks */
    lv_scale_set_major_tick_every(scale, 5);

    /* Style the scale */
    lv_obj_set_style_bg_opa(scale, LV_OPA_TRANSP, 0);
    lv_obj_set_style_border_width(scale, 0, 0);
    // lv_obj_set_style_border_color(scale, lv_color_hex(0x000000 ), 0);
    // lv_obj_set_style_radius(scale, LV_RADIUS_CIRCLE, 0);
    lv_obj_set_style_pad_all(scale, 20, 0);

    /* Style minor ticks */
    lv_obj_set_style_length(scale, 10, LV_PART_ITEMS);
    lv_obj_set_style_line_width(scale, 1, LV_PART_ITEMS);
    lv_obj_set_style_line_color(scale, lv_color_hex(0x888888), LV_PART_ITEMS);

    /* Style major ticks */
    lv_obj_set_style_length(scale, 15, LV_PART_INDICATOR);
    lv_obj_set_style_line_width(scale, 2, LV_PART_INDICATOR);
    lv_obj_set_style_line_color(scale, lv_color_black(), LV_PART_INDICATOR);

    /* Add text labels at major ticks */
    static const char *angle_labels[] = {"25", " ", " ", " ", " ", "0", " ", " ", " ", " ", "25", NULL};
    lv_scale_set_text_src(scale, angle_labels);

    /* Create a needle/indicator pointing to 0 degrees */
    needle = lv_line_create(scale);

    static lv_point_precise_t needle_points[2];
    needle_points[0].x = 0;
    needle_points[0].y = 0;
    needle_points[1].x = 0;
    needle_points[1].y = 120; /* Needle length */

    lv_line_set_points(needle, needle_points, 2);
    lv_obj_align(needle, LV_ALIGN_CENTER, 0, 0);

    /* Style the needle */
    lv_obj_set_style_line_width(needle, 4, 0);
    lv_obj_set_style_line_color(needle, lv_color_hex(0x000000), 0);
    lv_obj_set_style_line_rounded(needle, true, 0);

    lv_obj_t *label = lv_label_create(lv_screen_active());
    lv_label_set_text(label, "Delta-T+\n The Instrument Company\n");
    lv_obj_align_to(label, scale, LV_ALIGN_OUT_BOTTOM_MID, 0, 10);

    /* Style the label */
    lv_obj_set_style_text_color(label, lv_color_black(), 0);
    lv_obj_set_style_text_font(label, &lv_font_montserrat_14, 0);
  }

  /// updating text fields

  lv_obj_t *headerTextArea = lv_textarea_create(lv_scr_act());
  lv_textarea_set_one_line(headerTextArea, true);
  lv_obj_set_size(headerTextArea, 240, 24);
  lv_obj_align(headerTextArea, LV_ALIGN_TOP_MID, 0, 0);
  lv_textarea_set_text(headerTextArea, "Waiting for sensor data...");

  lv_obj_t *headerContainer = lv_obj_create(lv_scr_act());
  lv_obj_set_size(headerContainer, 240, 32);
  lv_obj_align(headerContainer, LV_ALIGN_TOP_MID, 0, 0);

  // Left label for switch state
  leftHeaderLabel = lv_label_create(headerContainer);
  lv_label_set_text(leftHeaderLabel, "LOW");
  lv_obj_align(leftHeaderLabel, LV_ALIGN_LEFT_MID, 0, 0);

  // Right label for battery
  rightHeaderLabel = lv_label_create(headerContainer);
  lv_label_set_text(rightHeaderLabel, "100%");
  lv_obj_align(rightHeaderLabel, LV_ALIGN_RIGHT_MID, 0, 0);

  lv_timer_create(updateLeftHeaderLabel, 200, leftHeaderLabel);
  lv_timer_create(updateRightHeaderLabel, 3000, rightHeaderLabel);

  lv_timer_create(updateNeedle, 100, needle);
}

//////////////////////////////////////////////////

// main timer implementation
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{

  if (htim == &htim16)
  {
    // if(init_finished) {
    //  increment / decrement 0.1ms timers here.

    timerCounter++;

    if ((timerCounter % 10) == 0)
    {

      lv_tick_inc(1);
      //  lv_timer_handler(); // Call every ~5-10ms

      if (myThermocouples.delay)
      {
        myThermocouples.delay--;
      }
      // increment / decrement 1 ms timers here.
    }

    if ((timerCounter % 100) == 0)
    {
      // increment / decrement 10 ms timers here.
      // if (thermocoupleDelay)
      //{
      //  thermocoupleDelay--;
      //}

      if (myTouch.delay)
      {
        myTouch.delay--;
      }

      if (myAccelerometer.readDelay)
      {
        myAccelerometer.readDelay--;
      }
    }

    if ((timerCounter % 1000) == 0)
    {
      // increment / decrement 100 ms timers here.
      // if (helloWorldDelay)
      //{
      //  helloWorldDelay--;
      //}
    }

    if ((timerCounter % 10000) == 0)
    {
      // increment / decrement 1000 ms timers here.  Note this resets the timer variable.

      loopsPerSecond = loopCounter;
      loopCounter = 0;
      measureFlag = 1; // Signal to print result

      timerCounter = 0;
      if (myAccelerometer.delay)
      {
        myAccelerometer.delay--;
      }
    }
    //}
  }
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
  if (hspi == &hspi2)
  {
    ST7789_CS_HIGH();
    lv_display_flush_ready(display1);
  }
}

// GPIO EXTI Callback - this is where you connect to the library
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{

  // Call the library's interrupt handler
  Touch_FT5436_IRQHandler(&myTouch.touch_controller, CTP_INT_Pin);
}

void my_flush_cb(lv_display_t *display, const lv_area_t *area, uint8_t *px_map)
{
#define USE_DMA_FOR_CB
#ifdef USE_DMA_FOR_CB
  /* The most simple case (also the slowest) to send all rendered pixels to the
   * screen one-by-one.  `put_px` is just an example.  It needs to be implemented by you. */
  ST7789_SetWindow(area->x1, area->y1, area->x2, area->y2);

  ST7789_CS_LOW();
  ST7789_DC_HIGH();

  int32_t width = area->x2 - area->x1 + 1;
  int32_t height = area->y2 - area->y1 + 1;
  uint32_t size = width * height * 2; // 2 bytes per pixel for RGB565

  lv_draw_sw_rgb565_swap(px_map, (area->x2 - area->x1 + 1) * (area->y2 - area->y1 + 1));

  HAL_SPI_Transmit_DMA(&hspi2, (uint8_t *)px_map, size);

#endif

#ifdef USE_LARGE_SPI_FOR_CB

  ST7789_SetWindow(area->x1, area->y1, area->x2, area->y2);

  int32_t width = area->x2 - area->x1 + 1;
  int32_t height = area->y2 - area->y1 + 1;
  uint32_t size = width * height * 2;

  // Use polling instead of DMA for testing
  HAL_SPI_Transmit(&hspi2, (uint8_t *)px_map, size, 1000);

  // Immediately notify LVGL that flush is complete
  lv_display_flush_ready(display);
#endif

#ifdef USE_SPI_IN_SLOW_FOR_LOOP
  uint16_t *buf16 = (uint16_t *)px_map; /* Let's say it's a 16 bit (RGB565) display */
  int32_t x, y;
  for (y = area->y1; y <= area->y2; y++)
  {
    for (x = area->x1; x <= area->x2; x++)
    {
      ST7789_WriteData16(*buf16);
      // put_px(x, y, *buf16);
      buf16++;
    }
  }

  /* IMPORTANT!!!
   * Inform LVGL that flushing is complete so buffer can be modified again. */
  lv_display_flush_ready(display);
#endif
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();
  /* Config code for STM32_WPAN (HSE Tuning must be done before system clock configuration) */
  MX_APPE_Config();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* IPCC initialisation */
  MX_IPCC_Init();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_RTC_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_SPI2_Init();
  MX_TIM2_Init();
  MX_USART1_UART_Init();
  MX_TIM16_Init();
  MX_RF_Init();
  /* USER CODE BEGIN 2 */

  // MX_APPE_Init();

  HAL_Delay(100);
  MX_USB_Device_Init();
  HAL_Delay(100);

  HAL_TIM_Base_Start_IT(&htim16);
  HAL_NVIC_SetPriority(TIM1_UP_TIM16_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(TIM1_UP_TIM16_IRQn);
  /* USER CODE END 2 */

  /* Init code for STM32_WPAN */
  MX_APPE_Init();

  myAccelerometer.setup();
  myThermocouples.setup();
  // myScreen.setup();
  myTouch.setup();
  myBacklight.setup();

  setupBatteryMonitor();

  snprintf((char *)UART_BUFFER, 64, "Setup finished\r\n");
  HAL_UART_Transmit(&huart1, UART_BUFFER, strlen((char *)UART_BUFFER), 300);

  // 1. Initialize LVLG early lv_init
  lv_init();
  // 2. Initialize TFT Driver
  ST7789_Init();

  // ST7789_FillScreen(0xf400);
  HAL_Delay(1000);
  // 3. Connect tick interface
  lv_tick_set_cb(HAL_GetTick);
  // 4. Connect display interface
  // 4.a create display
  display1 = lv_display_create(ST7789_WIDTH, ST7789_HEIGHT);

  // 4.b buffers
  lv_display_set_buffers(display1, buffer1, NULL, sizeof(buffer1), LV_DISPLAY_RENDER_MODE_PARTIAL);
  // 4.c flush callback
  lv_display_set_flush_cb(display1, my_flush_cb);

  // lv_example_analog_meter();

  brookes_meter();

  // lv_example_anim_timeline_1();

  // HAL_Delay(1000);

  // lv_obj_t *spinner = lv_spinner_create(lv_screen_active());
  // lv_obj_set_size(spinner, 100, 100);
  // lv_obj_center(spinner);
  // lv_spinner_set_anim_params(spinner, 1000, 90);  // 1 sec rotation, 90 degree arc

  // lv_tick_set_cb(HAL_GetTick);

  // lv_display_t *disp = lv_display_create(ST7789_WIDTH, ST7789_HEIGHT);

  // lv_display_set_flush_cb(disp, my_flush_cb);

  // LV_ATTRIBUTE_MEM_ALIGN

  // lv_display_set_buffers(disp, buffer1, NULL, sizeof(buffer1), LV_DISPLAY_RENDER_MODE_PARTIAL);

  // Create a simple test UI (v9 syntax)
  // lv_obj_t *label = lv_label_create(lv_screen_active());
  // lv_label_set_text(label, "Hello LVGL v9!");
  // lv_obj_center(label);

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    // loopCounter++; // Increment at start of each iteration

    /* USER CODE END WHILE */
    // MX_APPE_Process();

    /* USER CODE BEGIN 3 */
    // only MX_APPE_Process(); 151506 hz
    // myAccelerometer.stateMachine(); // 113495 hz
    // myBacklight.stateMachine(); // 77963 hz -> 83350 hz
    myThermocouples.stateMachine();

    // myScreen.stateMachine(); // 10hz
    // myTouch.stateMachine();

    // lv_example_event_draw();
    uint32_t time_till_next = lv_timer_handler();
    if (time_till_next == LV_NO_TIMER_READY)
      time_till_next = LV_DEF_REFR_PERIOD; /*handle LV_NO_TIMER_READY. Another option is to `sleep` for longer*/

    // meter_set_value(myThermocouples.deltaTemp);
    HAL_Delay(time_till_next);
    // HAL_Delay(5);

    // if (measureFlag)
    //{
    //  measureFlag = 0;
    // snprintf((char *)UART_BUFFER, 64, "Main loop: %lu Hz\r\n", loopsPerSecond);
    // HAL_UART_Transmit(&huart1, UART_BUFFER, strlen((char *)UART_BUFFER), 100);
    //}
  }
  /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Macro to configure the PLL multiplication factor
   */
  __HAL_RCC_PLL_PLLM_CONFIG(RCC_PLLM_DIV1);

  /** Macro to configure the PLL clock source
   */
  __HAL_RCC_PLL_PLLSOURCE_CONFIG(RCC_PLLSOURCE_MSI);

  /** Configure LSE Drive Capability
   */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_MEDIUMHIGH);

  /** Configure the main internal regulator output voltage
   */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_LSE | RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.MSICalibrationValue = RCC_MSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure the SYSCLKSource, HCLK, PCLK1 and PCLK2 clocks dividers
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK4 | RCC_CLOCKTYPE_HCLK2 | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.AHBCLK2Divider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLK4Divider = RCC_SYSCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Enable MSI Auto calibration
   */
  HAL_RCCEx_EnableMSIPLLMode();
}

/**
 * @brief Peripherals Common Clock Configuration
 * @retval None
 */
void PeriphCommonClock_Config(void)
{
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};

  /** Initializes the peripherals clock
   */
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SMPS | RCC_PERIPHCLK_RFWAKEUP;
  PeriphClkInitStruct.RFWakeUpClockSelection = RCC_RFWKPCLKSOURCE_LSE;
  PeriphClkInitStruct.SmpsClockSelection = RCC_SMPSCLKSOURCE_HSE;
  PeriphClkInitStruct.SmpsDivSelection = RCC_SMPSCLKDIV_RANGE1;

  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN Smps */
  LL_HSEM_1StepLock(HSEM, 5);

  /* USER CODE END Smps */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
